tsung/GET_RedCup_tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="3index.eba-miy5wk4c.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="15" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="3" duration="15" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="5" duration="15" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="7" duration="15" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="9" duration="15" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="11" duration="15" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="12" duration="10" unit="second">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="13" duration="15" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="30000"></option>
  </options>
  <sessions>
    <session name="get" type="ts_http" weight="1">
      <request>
        <http method="GET" url="/"></http>
      </request>
      <thinktime value="5" random="true"></thinktime>
      <request>
        <http method="GET" url="/vlogs?page=2"></http>
      </request>
      <thinktime value="5" random="true"></thinktime>
      <request>
        <http method="GET" url="/vlogs/1/"></http>
      </request>
      <request>
        <http method="GET" url="/vlogs/2/"></http>
      </request>
    </session>
  </sessions>
</tsung>